Repository: mariamm144/25620125B
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: 1 & ½ cups soft icing sugar mixture
es: 1 taza y media de mezcla de azúcar glas

source: 1 - 2 tbsp boiling water
es: 1 - 2 cucharadas de agua hirviendo

source: 1 1/2 tbs tahini
es: 1 1/2 cucharadita de tahini

source: 1 1/2 tsps salt
es: 1 y 1/2 cucharaditas de sal

source: 1 clove garlic
es: 1 diente de ajo

source: 1 egg
es: 1 huevo

source: 1 tbs baking powder
es: 1 cucharada de levadura en polvo

source: 1 tbsp sesame seeds optional
es: 1 cucharada sopera de semillas de sésamo opcional

source: 1 teaspoon nutmeg
es: 1 cucharadita de nuez moscada

source: 1 tsp salt
es: 1 cucharadita de sal

source: 1 tsp vanilla extract
es: 1 cucharadita de extracto de vainilla

source: 1 tsp worcestershire sauce
es: 1 cucharadita de salsa Worcestershire o salsa inglesa

source: 1 tsp raw sugar
es: 1 cucharadita de azúcar en bruto

source: 1 tsp soy sauce
es: 1 cucharadita de salsa de soja

source: 1 Thermomix
es: La Thermomix

source: 1 and ½ teaspoons will give you a regular strength iced coffee.
es: 1 y ½ cucharaditas para un café helado normal.

source: 1 banana
es: 1 plátano

source: 1 clove garlic or 1 teaspoon minced garlic
es: 1 diente de ajo or 1 cucharadita de ajo molido

source: 1 teaspoon will give you a more mild tasting iced coffee.
es: Con 1 cucharadita obtendrá un café helado de sabor más suave.

source: 1 tsp baking powder
es: 1 cucharadita de levadura

source: 1 x 20cm round cake tin
es: 1 molde de redondo de 20cm para horno

source: 1 x Baking Tray
es: 1 x bandeja para horno

source: 1 x Thermomix
es: La Thermomix

source: 1. Chop the dried apricots for 5 seconds, Speed 8.
es: 1. Corta los orejones durante 5 segundos, a velocidad 8.

source: 1. Place the butter into your Thermomix bowl and mix for 20 seconds, speed 2.
es: 1. Coloca la mantequilla en tu cuenco de Thermomix y remuévela durante 20 segundos a velocidad 2.

source: 1. Preheat oven to 180 degrees celsius (fan-forced).
es: 1. Precalentar el horno a 180 grados Celsius (con la ventilación a tope).

source: 1. Preheat your oven to 180 degrees (fan-forced) and line the base and sides of a large loaf tin with baking paper.
es: 1. Precalienta el horno a 180 grados centígrados (con ventilador) y forra la base y las paredes de un molde con papel de cocina.

source: 1. Preheat your oven to 180 degrees celsius (fan-forced) and line a 12-hole muffin tray with paper cases.
es: 1. Precalienta el horno a 180 grados centígrados (con ventilador) y forra con papel de hornear una bandeja con 12 huecos para muffins.

source: 1. Preheat your oven to 180 degrees celsius (fan-forced) and line a 20cm round baking tin with baking paper.
es: 1. Precalienta el horno a 180 grados centígrados (con ventilador) y forra un molde redondo de 20 cm con papel de cocina.

source: 1/2 tsp sea salt
es: 1/2 cucharadita de sal de mar

source: 1/2 tsp salt
es: 1/2 cucharadita de sal

source: 1/4 tsp pepper
es: 1/4 cucharadita de primienta

source: 1/4 tsp salt
es: 1/4 cucharadita de sal

source: 10. Bake for 8 - 10 minutes or until the sugar cookies are beginning to turn golden on the edge.
es: 10. Hornea durante 8 - 10 minutos o hasta que las galletas de azúcar empiecen a dorarse por los bordes.

source: 100 grams baby spinach leaves
es: 100 gramos hojas de espinacas baby

source: 100 g butter
es: 100 g mantequilla

source: 100 grams carrot cut into 3cm pieces
es: 100 gramos de zanahoria cortada en trozos de 3 cm

source: 100 grams zucchini cut into 3cm pieces
es: 100 gramos de calabacín cortado en trozos de 3cm

source: 100 g brown sugar
es: 100 g de azúcar moreno

source: 100 g caster sugar
es: 100 g de azúcar molido

source: 100 grams caster sugar
es: · 100 gramos de azúcar molido

source: 11. Allow to cool on the tray for 5 minutes before transferring to a wire tray to cool completely.
es: 11. Deja enfriar en la bandeja durante 5 minutos antes de transferir a una bandeja de rejilla para enfriar completamente.

source: 110 grams butter at room temp
es: 110 gramos de mantequilla a temperatura ambiente

source: 110 grams caster sugar
es: 110 gramos de azúcar molida

source: 12. Once cool, decorate as desired.
es: 12. Una vez frías, decorar al gusto.

source: 125 g butter
es: 125 g de mantequilla

source: 125 g cheddar cheese or tasty cheese
es: 125 g de queso cheddar o queso sabroso

source: 125 g full fat milk
es: 125 ml de leche entera

source: 125 g milk full cream
es: 125 ml de leche enteracream

source: 125 grams butter at room temperature
es: 125 gramos de mantequilla a temperatura ambiente

source: 125 grams butter softened
es: 125 gramos de mantequilla derretida

source: 130 grams milk
es: 130 ml de leche

source: 15 g caster sugar optional
es: 15 g de azúcar glas opcional

source: 15 grams milk
es: 15 gramos de leche

source: 150 g milk
es: 150 ml leche

source: 150 grams butter at room temperature
es: 150 gramos de mantequilla a temperatura ambiente

source: 150 grams plain flour in a separate bowl for coating.
es: 150 gramos de harina común en un bol aparte para rebozar

source: 150 g bacon or ham
es: 150 g de bacon o jamón

source: 150 g nut-free toasted muesli (~1 ½ cups)
es: 150 g de muesli tostado sin frutos secos (~1 taza ½ )

source: 150 grams Cheese
es: 150 gramos de queso

source: 150 grams butter
es: 150 gr de mantequilla

source: 15 g olive oil
es: 15 ml aceite de oliva

source: 160 g sourdough starter
es: 160 g de masa madre

source: 160 g sultanas
es: 160 g de pasas sultanas

source: 165 grams caster sugar
es: 165 gramos de azúcar molido

source: 170 grams caster sugar
es: 170 gramos de azúcar glas

source: 170 grams milk
es: 170 ml de leche

source: 180 g honey
es: 180 g de miel

source: 18cm X 28cm slice tin
es: Una bandejade 18 cm X 28 cm

source: 190 g lukewarm water
es: 190 ml de agua tibia

source: 190 g dried apricots
es: 190 g albaricoques secos

source: 190 grams self raising flour
es: 190 g de harina con levadura

source: 1 apple
es: 1 manzana

source: 1 tbs chia seeds
es: 1 cucharadita de semillas de chía

source: 1 teaspoon baking powder
es: 1 cucharadita de levadura en polvo

source: 1 teaspoon butter room temperature
es: Una cucharadita de mantequilla a temperatura ambiente

source: 1 teaspoon cocoa
es: 1 cucharita de cacao

source: 1 teaspoon ground cinnamon
es: 1 cucharadita de canela en polvo

source: 1 teaspoon honey
es: 1 cucharadita de miel

source: 1 teaspoon vanilla extract
es: 1 cucharadita de extracto de vainilla

source: 2 tsp dry yeast
es: 2 cucharaditas de levadura seca

source: 2 tsp yeast
es: 2 cucharaditas de levadura

source: 2 tsp instant coffee granules see notes
es: 2 cucharaditas de café instantáneo granulado véase notas

source: 2 x Baking Trays
es: 2 x bandejas para hornear

source: 2. Add all of the remaining ingredients and mix together for 10 seconds, Speed 6.
es: 2. Añade todos los ingredientes restantes y remuévelos durante 10 segundos a velocidad 6.

source: 2. Chop the butter and place into your Thermomix bowl.
es: 2. Pica la mantequilla y ponla en el bol de la Thermomix.

source: 2. Peel the apple and roughly chop it into pieces no bigger than 1cm.
es: 2. >Pela la manzana y córtala en trozos de no más de 1 cm.

source: 2. Place the butter and caster sugar into the Thermomix bowl.
es: 2. Coloca la mantequilla y el azúcar glas en el cuenco de Thermomix.

source: 2. Place the butter and caster sugar into your Thermomix bowl and mix for 30 seconds, Speed 3.
es: 2. Coloca la mantequilla en el cuenco de Thermomix y remuévela durante 30 segundos a velocidad 3.

source: 2. Scrape down the sides of your Thermomix bowl and add the caster sugar, baking powder and salt and mix for 20 seconds, speed 3.
es: 2. Raspa los laterales de tu cuenco de Thermomix y añade el azúcar molido, la harina y la sal, y remueve durante 20 segundos a velocidad 3.

source: 20 grams extra virgin olive oil
es: 20 ml de aceite de oliva virgen extra

source: 20 g olive oil
es: 20 g aceite de oliva

source: 200 g mini Easter eggs see notes
es: 200 g mini huevos de pascua (ver en las notas)

source: 200 g ice cubes
es: 200 g de cubitos de hielo

source: 200 g milk any variety - skim, full cream, almond, soy, oat etc
es: 200 ml de leche de cualquier variedad: desnatada, entera, de almendras, de soja, de avena, etc.

source: 200 g chocolate baking chips
es: 150 g de pepitas de chocolate para hornear

source: 200 grams milk
es: 200 ml de leche

source: 200 grams self raising flour
es: 200 gramos de harina con levadura

source: 200g g self raising flour
es: 200 g de harina con levadura

source: 20 g desiccated coconut
es: 20 g de coco deshidratado

source: 225 grams self raising flour
es: 225 gramos de harina con levadura

source: 230 g water
es: 230 mlde agua

source: 240 grams self raising flour
es: 240 gramos de harina con levadura

source: 250 grams warm water
es: 250 ml agua templada

source: 250 g milk chocolate
es: 250 g leche de chocolate

source: 250 g plain sweet biscuits
es: 250 g de galletas dulces planas

source: 250 g self-raising flour
es: 250 g de harina con levadura

source: 260 g ripe bananas (approx 2 large)
es: 260 g de plátanos maduros (aprox 2 grandes)

source: 2 eggs
es: 2 huevos

source: 2 eggs 70 gram eggs
es: 2 huevos 70 gramos de huevo

source: 2 tablespoons caster sugar
es: 2 cuchadaras de azúcar en polvo

source: 2 tbs coconut oil melted
es: 2 cucharaditas de aceite de coco derretido

source: 2 tbs rice malt syrup or honey
es: 2 cucharadas de sirope de arroz malteado o miel

source: 2 tsp cinnamon
es: 2 cucharaditas de canela en polvo

source: 3 x Baking Trays
es: 3 bandejas para hornear

source: 3. Add the condensed milk and mix for 30 seconds, Speed 5.
es: 3. Añade la leche condensada y remuévelo durante 30 segundos, a velocidad 5.

source: 3. Add the egg, milk and vanilla extract and mix for 10 seconds, speed 3.
es: 3. Añade el huevo, la leche y el extracto de vainilla y remuévelo durante 10 segundos a velocidad 3.

source: 3. Add the self-raising flour, caster sugar, milk, eggs and vanilla extract and mix for 10 seconds, Speed 5.
es: 3. Añade la harina con levadura, el azúcar molido, leche, huevos el extracto de vainilla, y remueve durante 10 segundos a velocidad 5.

source: 3. Add the vanilla extract, milk, eggs and self raising flour and mix for 10 seconds, Speed 4.
es: 3. Añade el extracto de vainilla, leche, huevos y la harina con levadura, y remuévelo durante 10 segundos, a velocidad 4.

source: 3. Place the self raising flour, caster sugar, butter, vanilla extract, eggs and milk into your Thermomix bowl and mix for 15 seconds, speed 5.
es: 3. Pon la harina con levadura, el azúcar molido, la mantequilla, el extracto de vainilla, los huevos y la leche en el bol de la Thermomix y mézclelos durante 15 segundos a velocidad 5.

source: 3. Roll the mixture into balls.
es: 3. Haz bolitas con la mezcla.

source: 30 g vegetable or rice bran oil
es: 30 ml de aceite vegetal o de salvado de arroz

source: 300 g sweetened condensed milk
es: 300 g de lechecondensada

source: 300 grams plain flour
es: 300 gramos de harina común

source: 300 grams blueberries – fresh or frozen
es: 300 gramos de arándanos, frescos o congelados

source: 300 grams self raising flour
es: 300 gramos de harina con levadura

source: 30 g rice bubbles
es: 30 g burbujas de arroz

source: 350 grams water
es: 350 ml de agua

source: 375 grams milk
es: 375 gramos de leche

source: 375 grams self raising flour
es: 375 gramos de harina con levadura

source: 395 grams sweetened condensed milk
es: 395 gramos de leche condensada azucarada

source: 4 sheets puff pastry partially thawed
es: 4 hojas de hojaldre amasadas parcialmente descongeladas

source: 4. Add 250g of the self-raising flour and mix for 20 seconds, Speed 6.
es: 4. Añade 250g de harina con levadura remuévelo durante 20 segundos, a velocidad 6.

source: 4. Add the blueberries and gently stir through using your spatula.
es: 4. Añade los arándanos y remuévelo suavemente con la espátula.

source: 4. Scrape down the sides of the bowl and add the plain flour and mix for 10 seconds, speed 4.
es: 4. Raspa los laterales de tu cuenco, añade la harina y remuévelo durante 10 segundos a velocidad 4.

source: 4. Scrape down the sides of the bowl and mix for a further 10 seconds, speed 4 or until the mixture is smooth and well combined.
es: 4. Raspa los laterales del cuenco de Thermomix y remueve todo a velocidad 4 durante 5 segundos más o hasta que se mezcle bien.

source: 4. Scrape down the sides of the bowl and mix for a further 5 seconds, Speed 4 or until well combined.
es: 4. Raspa los laterales de tu cuenco de Thermomix y remueve todo a velocidad 4 durante 5 segundos más o hasta que se mezcle bien.

source: 400 g Bakers flour or strong bread flour
es: 400 g de Harina de panadería o harina de fuerza

source: 400 g can chickpeas drained (keep the liquid aside)
es: 400 g de garbanzos cocidos (mantén el líquido aparte)

source: 400 g sushi rice
es: 400 g arroz de sushi

source: 450 g plain flour (or Bakers flour)
es: 450 g de harina normal (o harina de panadería)

source: 4 eggs
es: 4 huevos

source: 4 sheets puff pastry defrosted
es: 4 hojas de hojaldre descongelado

source: 5 g salt
es: 5 g de sal

source: 5. Divide the cookie dough between bowls and flavour however you'd like (see notes).
es: 5. Divide la masa de las galletas entre los cuencos y condimenta a tu gusto (ver en Notas).

source: 5. Mix for a further 2 minutes using the dough/interval function.
es: 5. Remuévelo durante 2 minutos más usando la función de masa/intervalos.

source: 5. Pour the mixture into your prepared loaf tin and sprinkle the apple pieces over the top.
es: 5. Vierte la mezcla en el molde preparado y oon los trozos de manzana encima.

source: 5. Spoon the mixture into the prepared muffin tin (filling to ⅔ full) and bake for 18-20 minutes or until golden and cooked through when tested with a skewer.
es: 5. Vierte la mezcla en el molde para muffins (llenándolo hasta ⅔ de su capacidad) y hornea durante 18-20 minutos o hasta que se doren y estén hechos al probarlos con una brocheta.

source: 5. Transfer the mixture in three equal parts (approx 180g each) and add the cocoa to one and a couple of drops of pink food colouring (or cochineal if using) to the other.
es: 5. Reparte la mezcla en tres partes iguales (aproximadamente 180 g cada una) y añadir el cacao a una y un par de gotas de colorante alimentario rosa (o cochinilla si se utiliza) a la otra.

source: 50 g apple cored and chopped (approx ½ an apple)
es: 50 g de manzana sin pepitas y troceada (aprox. ½ manzana)

source: 500 grams Baker's flour see notes
es: 500 gramos de harina de panadería ver notas.

source: 500 grams beef mince
es: 500 gramos decarne picadade ternera

source: 500 grams ricotta
es: 500 gramos de ricotta

source: 500 grams extra water
es: 500 gramos extra de agua

source: 500 grams butter softened
es: 500 gramos de mantequilla derretida

source: 50 grams butter extra to grease frying pan
es: 50 g de mantequillaextra para engrasar la sartén

source: 520 grams plain flour
es: 520 gramos de harina común

source: 6. Add spoonfuls of the three different coloured mixtures to your prepared loaf tin and once all the mixture is in the tin, use a butter knife to gently swirl the mixture to create the ‘marble’ effect.
es: 6. Añade cucharadas de las tres mezclas de colores diferentes al molde preparado y, una vez que toda la mezcla esté en el molde, utilice un cuchillo para mantequilla para remover suavemente la mezcla y crear el efecto "mármol".

source: 6. Place the Apple Loaf into your oven and bake for 50 - 55 minutes or until cooked when tested with a skewer.
es: 6. Coloca el molde con la masa en el horno y cocínala durante 50-55 minutos o hasta que estén hechos al probarlos con una brocheta.

source: 6. Roll into teaspoon-sized balls and place onto the prepared baking trays.
es: 6. Forma bolas del tamaño de una cucharadita y colócalas en las bandejas de horno preparadas..

source: 6. Turn the dough out onto your bench and divide into two.
es: 6. Vuelca la masa en tu encimera y divídela en dos.

source: 60 grams sugar
es: 60 gramos de azúcar

source: 60 grams extra virgin olive oil
es: 60 ml de aceite virgen extra

source: 60 g butter
es: 60 g de mantequilla

source: 60 grams butter
es: 60 g de mantequilla

source: 7 g dried yeast
es: 7 g levadura seca

source: 7. Bake for 10-12 minutes.
es: 7. Hornear durante 10-12 minutos.

source: 7. Once the dough has chilled, preheat your oven to 180 degrees celsius (fan forced) and line two trays with baking paper.
es: 7. Una vez que la masa se haya enfriado, precalienta el horno a 180 grados Celsius (con la ventilación a tope) y forra dos bandejas con papel de cocina.

source: 7. Place the cake tin into the oven and cook for 30 – 35 minutes or until your marble cake is cooked through when tested with a skewer.
es: 7. Coloca el molde en el horno y cocina los muffins durante 30-35 minutos o hasta que estén hechos al probarlos con una brocheta.

source: 70 g rolled oats
es: 70 g de copos de avena

source: 750 grams self-raising flour
es: 750 gramos de harina leudante

source: 8. Cool in tin for 5 minutes before transferring to a wire rack to cool completely.
es: 8. Deja enfriar en la bandeja durante 5 minutos antes de transferir a una bandeja de rejilla para enfriar completamente.

source: 8. Roll the dough on your bench until it's approximately 4 mm thick and use the cutter of your choice to make shapes.
es: 8. Enrolla la masa en la encimera hasta que tenga aproximadamente 4 mm de grosor y utiliza el cortador de tu elección para hacer formas.

source: 80 grams parmesan cheese
es: 80 gramos queso parmesano

source: 80 g butter
es: 80 g de mantequilla

source: 80 grams milk
es: 80 gramos de leche

source: 9. Place the cut out sugar cookies onto your prepared trays and continue until all of the dough has been used.
es: 9. Coloca las galletas de azúcar recortadas en las bandejas preparadas y continúa hasta que hayas utilizado toda la masa.

source: 9. Store in an airtight container or freeze indivually wrapped slices in the freeer for up to 3 months.
es: 9. Consérvalos en un recipiente hermético o congélalos envueltos individualmente en el frigorífico hasta 3 meses.

source: 90 g desiccated coconut
es: 90 g coco deshidratado

source: 90 g greek or natural yoghurt
es: 90 g de yogur griego o natural

source: 90 grams brown onion cut in half
es: 90 gramos de cebolla morena cortada por la mitad

source: 90 grams butter
es: 90 gramos de mantequilla

source: 950 g water
es: 950 ml de agua

source: 95 g mini chocolate chips (½ cup)
es: 95 g de pepitas de chocolate (½ taza)

source: Allow to cool slightly.
es: Dejar enfriar un poco.

source: Knead for 10 minutes, Kneading Function.
es: Amasa durante 10 minutos, con la función de amasar.

source: Mix on Speed 6, 5 seconds.
es: Mezcla a velocidad 6, 5 segundos.

source: Pour into a seperate bowl and set aside.
es: Viértelo en un bol diferente y déjalo apartado.

source: Press down lightly with a fork.
es: Presiónalo ligeramente con un tenedor.

source: Rinse under cold water.
es: Enjuaga bajo agua fría.

source: Scrape down the bowl.
es: Raspa el vaso entero.

source: Scrape down the sides of the bowl.
es: Raspa todos los laterales del vaso.

source: Set aside until needed.
es: Deja a un lado hasta que haga falta.

source: Set aside.
es: Apártalo.

source: Sprinkle it with a tiny amount of water.
es: Espolvoréalo con unapequeña cantidad de agua.

source: Sprinkle the cheese - reserve approximately ¼ cup of cheese.
es: Espolvorea el queso, reserva aproximadamente ¼ taza de queso.

source: The cooked biscuits are also freezer friendly.
es: Las galletas horneadas tambiénson aptas para el congelador.

source: This is completely normal.
es: Esto es completamente normal.

source: So your dark brown bananas as perfect to use.
es: Por lo tanto, los plátanos oscuros vienen perfectos.

source: Wash and dry the bowl.
es: Lava y seca el cuenco.

source: Cook for 30 minutes, Varoma temperature, Speed 4.
es: Cocina durante 30 minutos, temperatura Varoma , velocidad 4.

source: Grease and line 3 baking trays and set aside (or as many trays as will fit in your oven).
es: Aceita y forra 3 bandejas (o cuantas te quepan en el horno) y deja a un lado.

source: Scrape down the sides.
es: Raspa los laterales del vaso.

source: Mix to create the coloured mixture.
es: Mezcla para lograr la mezcla coloreada.

source: Scrape down.
es: Raspa las paredes del bol.

source: A simple Thermomix Easter Egg Slice filled with yummy chocolate Easter eggs... and it's completely no-bake!!
es: Una simple tira de Huevo de Pascua con Thermomix condeliciosos huevos de Pascua de chocolate... ¡y sin cocer!

source: A simple and delicious Thermomix Naan Bread that is perfect served with curries, rice, butter chicken and more!
es: Un pan Naan sencillo y delicioso con Thermomix es perfecto para acompañar curry, arroz, pollo a la mantequilla y mucho más.

source: A winner with the whole family - these Thermomix Spinach and Ricotta Rolls are always a favourite!
es: Una forma de ganar con toda la familia. ¡Estos rollos de espinacas y ricotta con Thermomix son siempre los favoritos!

source: Add 250g of the self-raising flour and mix for 20 seconds, Speed 6.
es: Añade 250g de harina con levadura y remueve durante 20 segundos, velocidad 6.

source: Add all of the remaining ingredients and mix together for 10 seconds, Speed 6.
es: Añade todos los ingredientes restantes y remuévelos durante 10 segundos, velocidad 6.

source: Add all of the remaining ingredients to the Thermomix bowl.
es: Añade el resto de ingredientes dentro del vaso.

source: Add spoonfuls of the three different coloured mixtures to your prepared loaf tin and once all the mixture is in the tin, use a butter knife to gently swirl the mixture to create the ‘marble’ effect.
es: Añade cucharadas de las tres mezclas de colores diferentes al molde preparado y, una vez que toda la mezcla esté en el molde, utiliza un cuchillo para mantequilla para removerla suavemente y crear el efecto "marmoleado".

source: Add another 250g of the self-raising flour and mix for a further 20 seconds.
es: Añade otros 250g de harina con levadura y remueve durante 20 segundos más.

source: Add as much or as little as you like to suit your taste preferences.
es: Añade la cantidad que desees según tus preferencias.

source: Add one tablespoon of boiling water and then add an additional ½ tablespoon at a time until your icing is a spreadable consistency.
es: Añade una cucharada de agua hirviendo y luego media cucharada más hasta que el glaseado tenga una consistencia untable.

source: Add the mini Easter eggs and mix for 10 seconds, REVERSE, Speed 3, using the spatula to help mix.
es: Añade losmini huevos de Pascua y mezcla durante 10 segundos, REVERSO, velocidad 3, usando la espátula para mezclar mejor.

source: Add the self raising flour, caster sugar, milk, egg and a sprinkle of salt and mix for 10 seconds on speed 5.
es: Añade la harina con levadura, el azcúar en polvo, leche, el huevo y una pizca de sal y mezclar durante 10 segundos, velocidad 5.

source: Add the self raising flour, egg and vanilla extract and mix for 10 seconds, speed 4.
es: Añade la harina con levadura, un huevo y extracto de vainilla y mezcla durante 10 segundos, velocidad 4.

source: Add the self raising flour, milk, vanilla extract, banana and egg and mix for 10 seconds, Speed 5.
es: Añade la harina con levadura, la leche, el extracto de vainilla, el plátano y el huevo y mezcla durante 10 segundos, velocidad 5.

source: Add the apple (which has been cut into chunks) and mix for 4 seconds, Speed 5, to grate.
es: Añade la manzana cortada en trozos y mezcla durante 4 segundos, velocidad 5, para rallar.

source: Add the blueberries and gently stir through using your spatula.
es: Añade los arándanos y remueve suavemente con la espátula.
